switch to mermaid
